Applying:

```
data.google_client_config.default: Reading...
data.google_container_cluster.play_grafana: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/raintank-dev/regions/us-central1/zones/]
data.google_container_cluster.play_grafana: Read complete after 1s [id=projects/raintank-dev/locations/us-central1/clusters/raintank-dev-play-grafana-gke]
module.influxdb.kubernetes_service.service_influxdb: Refreshing state... [id=play-backends/influxdb]
module.clickhouse.kubernetes_service.service_clickhouse: Refreshing state... [id=play-backends/clickhouse]
module.k6-http.kubernetes_service.service_httpbin: Refreshing state... [id=play-backends/k6-http]
module.clickhouse.kubernetes_ingress_v1.ingress_clickhouse: Refreshing state... [id=play-backends/clickhouse]
module.elasticstack.kubernetes_service.service_kibana: Refreshing state... [id=play-backends/kibana]
module.mysql.kubernetes_service.service_mysql: Refreshing state... [id=play-backends/mysql]
module.k6-bin.kubernetes_deployment.deployment_k6test: Refreshing state... [id=play-backends/k6-php]
module.elasticstack.kubernetes_deployment.deployment_elasticsearch: Refreshing state... [id=play-backends/elasticsearch]
module.influxdb.kubernetes_deployment.deployment_influxdb: Refreshing state... [id=play-backends/influxdb]
module.k6-http.kubernetes_deployment.deployment_httpbin: Refreshing state... [id=play-backends/k6-http]
module.elasticstack.kubernetes_service.service_elasticsearch: Refreshing state... [id=play-backends/elasticsearch]
module.redis.kubernetes_service.service_redis: Refreshing state... [id=play-backends/redis]
module.elasticstack.kubernetes_ingress_v1.ingress_elastic: Refreshing state... [id=play-backends/elastic]
module.opentsdb.kubernetes_deployment.deployment_opentsdb: Refreshing state... [id=play-backends/opentsdb]
module.influxdb.kubernetes_ingress_v1.ingress_influx: Refreshing state... [id=play-backends/influxdb]
module.k6-bin.kubernetes_service.service_k6test: Refreshing state... [id=play-backends/k6-php]
module.postgres.kubernetes_deployment.deployment_postgresdb: Refreshing state... [id=play-backends/postgresdb]
module.opentsdb.kubernetes_service.service_opentsdb: Refreshing state... [id=play-backends/opentsdb]
module.elasticstack.kubernetes_ingress_v1.ingress_kibana: Refreshing state... [id=play-backends/kibana]
module.postgres.kubernetes_service.service_postgresdb: Refreshing state... [id=play-backends/postgresdb]
module.redis.kubernetes_deployment.deployment_redis: Refreshing state... [id=play-backends/redis]
module.mysql.kubernetes_deployment.deployment_mysql: Refreshing state... [id=play-backends/mysql]
module.k6-http.kubernetes_ingress_v1.ingress_httpbin: Refreshing state... [id=play-backends/k6-http]
module.opentsdb.kubernetes_ingress_v1.ingress_opentsdb: Refreshing state... [id=play-backends/opentsdb]
module.mysql.kubernetes_config_map_v1.mysql-configmap: Refreshing state... [id=play-backends/mysql-setup]
module.influxdb.kubernetes_config_map_v1.influxdb-configmap: Refreshing state... [id=play-backends/influxdb-configmap]
module.k6-bin.kubernetes_service_account_v1.service_account_k6: Refreshing state... [id=play-backends/k6-php]
module.clickhouse.kubernetes_deployment.deployment_clickhouse: Refreshing state... [id=play-backends/clickhouse]
module.k6-bin.kubernetes_ingress_v1.ingress_k6test: Refreshing state... [id=play-backends/k6-php]
module.elasticstack.kubernetes_config_map_v1.kibana-configmap: Refreshing state... [id=play-backends/kibana-configmap]
module.elasticstack.kubernetes_manifest.deployment_kibana: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.k6-grpc.kubernetes_deployment.deployment_grpc will be created
  + resource "kubernetes_deployment" "deployment_grpc" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "k6-grpc"
            }
          + name             = "k6-grpc"
          + namespace        = "play-backends"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "2"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "k6-grpc"
                }
            }

          + strategy {
              + type = "Recreate"
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "k6-grpc"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "grafana/k6-grpcbin:latest"
                      + image_pull_policy          = "IfNotPresent"
                      + name                       = "k6-grpc"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 10
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 60

                          + http_get {
                              + path   = "/"
                              + port   = "8080"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 8080
                          + name           = "web"
                          + protocol       = "TCP"
                        }
                      + port {
                          + container_port = 9000
                          + name           = "grpc"
                          + protocol       = "TCP"
                        }

                      + readiness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 10
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 60

                          + http_get {
                              + path   = "/"
                              + port   = "8080"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "10m"
                              + "memory" = "200Mi"
                            }
                          + requests = {
                              + "cpu"    = "5m"
                              + "memory" = "150Mi"
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = false
                          + privileged                 = false
                          + read_only_root_filesystem  = true
                          + run_as_non_root            = true
                          + run_as_user                = "1000"

                          + capabilities {
                              + drop = [
                                  + "NET_RAW",
                                ]
                            }
                        }
                    }
                }
            }
        }
    }

  # module.k6-grpc.kubernetes_service.service_httpbin will be created
  + resource "kubernetes_service" "service_httpbin" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "k6-grpc"
            }
          + name             = "k6-grpc"
          + namespace        = "play-backends"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + load_balancer_ip                  = "34.135.109.84"
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "k6-grpc"
            }
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "8080"
            }
          + port {
              + name        = "https"
              + node_port   = (known after apply)
              + port        = 443
              + protocol    = "TCP"
              + target_port = "8080"
            }
          + port {
              + name        = "grpc"
              + node_port   = (known after apply)
              + port        = 9000
              + protocol    = "TCP"
              + target_port = "9000"
            }
          + port {
              + name        = "grpctls"
              + node_port   = (known after apply)
              + port        = 9001
              + protocol    = "TCP"
              + target_port = "9000"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with module.k6-bin.kubernetes_service_account_v1.service_account_k6,
  on k6-php/main.tf line 140, in resource "kubernetes_service_account_v1" "service_account_k6":
 140: resource "kubernetes_service_account_v1" "service_account_k6" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```